---
type: CurveByPoints
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# CurveByPoints

`Autodesk.Revit.DB.CurveByPoints` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetPoints | — | `public ReferencePointArray GetPoints ()` |
| Method | GetVisibility | — | `public FamilyElementVisibility GetVisibility ()` |
| Method | SetPoints | — | `public void SetPoints ( ReferencePointArray points )` |
| Method | SetVisibility | — | `public void SetVisibility ( FamilyElementVisibility visibility )` |
| Method | SortPoints | — | `public static bool SortPoints ( ReferencePointArray arr )` |
| Property | IsReferenceLine | — | `public bool IsReferenceLine { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | ReferenceType | — | `public ReferenceType ReferenceType { get ; set ; }` |
| Property | SketchPlane | — | `public override SketchPlane SketchPlane { get ; set ; }` |
| Property | Subcategory | — | `public GraphicsStyle Subcategory { get ; set ; }` |
| Property | Visible | — | `public bool Visible { get ; set ; }` |